Revit 2027 API
FamilyThermalProperties.SolarHeatGainCoefficient Property
 The solar heat gain coefficient.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SolarHeatGainCoefficient { get; }
Public ReadOnly Property SolarHeatGainCoefficient As Double
	Get
public:
property double SolarHeatGainCoefficient {
	double get ();
}
member SolarHeatGainCoefficient : float with get
Property Value
Double
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace